# Manipulação de dados com o Pandas

In [2]:
from platform import python_version 
print('Versão da linguagem python usada nesse curso', python_version())

Versão da linguagem python usada nesse curso 3.11.5

In [11]:
!pip install -q ==1.5.3

ERROR: Invalid requirement: '==1.5.3'

In [13]:
import pandas as pd

In [14]:
print(pd.__version__)

2.0.3

# Manipulando dados de um dataFrames do Pandas

In [21]:
dados = {
    'Estado': ['Santa Catarina', 'Rio de Janeiro', 'Tocantins', 'Bahia', 'Minas Gerais'],
    'Ano': [2004, 2005, 2006, 2007, 2008],
    'Taxa de Desemprego': [1.5, 5.1, 1.7, 7.2, 2.4]
}

In [22]:
from pandas import DataFrame

In [23]:
df = DataFrame(dados)

In [25]:
df.head()

           Estado   Ano  Taxa de Desemprego
0  Santa Catarina  2004                 1.5
1  Rio de Janeiro  2005                 5.1
2       Tocantins  2006                 1.7
3           Bahia  2007                 7.2
4    Minas Gerais  2008                 2.4

In [26]:
type(df)

pandas.core.frame.DataFrame

In [30]:
# Reogarnizando as colunas 
df = DataFrame(dados, columns=['Estado', 'Taxa de Desemprego', 'Ano'])
print(df)

           Estado  Taxa de Desemprego   Ano
0  Santa Catarina                 1.5  2004
1  Rio de Janeiro                 5.1  2005
2       Tocantins                 1.7  2006
3           Bahia                 7.2  2007
4    Minas Gerais                 2.4  2008

In [33]:
df2 = DataFrame (dados, 
                 columns = ['Estado', 'Taxa de Desemprego', 'Taxa de Crescimento', 'Ano'],
                index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [34]:
df2

                 Estado  Taxa de Desemprego Taxa de Crescimento   Ano
estado1  Santa Catarina                 1.5                 NaN  2004
estado2  Rio de Janeiro                 5.1                 NaN  2005
estado3       Tocantins                 1.7                 NaN  2006
estado4           Bahia                 7.2                 NaN  2007
estado5    Minas Gerais                 2.4                 NaN  2008

In [35]:
df2.columns

Index(['Estado', 'Taxa de Desemprego', 'Taxa de Crescimento', 'Ano'], dtype='object')

In [36]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 5.1, nan, 2005],
       ['Tocantins', 1.7, nan, 2006],
       ['Bahia', 7.2, nan, 2007],
       ['Minas Gerais', 2.4, nan, 2008]], dtype=object)

In [40]:
df2.dtypes

Estado                  object
Taxa de Desemprego     float64
Taxa de Crescimento     object
Ano                      int64
dtype: object

In [42]:
df2.columns

Index(['Estado', 'Taxa de Desemprego', 'Taxa de Crescimento', 'Ano'], dtype='object')

In [44]:
# Imprimindo apenas uma coluna
df2['Estado']

estado1    Santa Catarina
estado2    Rio de Janeiro
estado3         Tocantins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [45]:
df2 [['Taxa de Desemprego', 'Ano']]

         Taxa de Desemprego   Ano
estado1                 1.5  2004
estado2                 5.1  2005
estado3                 1.7  2006
estado4                 7.2  2007
estado5                 2.4  2008

In [46]:
df2.index

Index(['estado1', 'estado2', 'estado3', 'estado4', 'estado5'], dtype='object')

In [48]:
df2.filter(items = ['estado3'], axis = 0)

            Estado  Taxa de Desemprego Taxa de Crescimento   Ano
estado3  Tocantins                 1.7                 NaN  2006

# Usando Numpy e Pandas para manipulação de dados

In [49]:
import numpy as np

In [50]:
df2.head

<bound method NDFrame.head of                  Estado  Taxa de Desemprego Taxa de Crescimento   Ano
estado1  Santa Catarina                 1.5                 NaN  2004
estado2  Rio de Janeiro                 5.1                 NaN  2005
estado3       Tocantins                 1.7                 NaN  2006
estado4           Bahia                 7.2                 NaN  2007
estado5    Minas Gerais                 2.4                 NaN  2008>

In [51]:
df2.dtypes

Estado                  object
Taxa de Desemprego     float64
Taxa de Crescimento     object
Ano                      int64
dtype: object

In [53]:
# Resumo estatistico do dataframe
df2.describe()

       Taxa de Desemprego          Ano
count            5.000000     5.000000
mean             3.580000  2006.000000
std              2.483345     1.581139
min              1.500000  2004.000000
25%              1.700000  2005.000000
50%              2.400000  2006.000000
75%              5.100000  2007.000000
max              7.200000  2008.000000

In [55]:
df2.isna()

         Estado  Taxa de Desemprego  Taxa de Crescimento    Ano
estado1   False               False                 True  False
estado2   False               False                 True  False
estado3   False               False                 True  False
estado4   False               False                 True  False
estado5   False               False                 True  False

In [56]:
df2['Taxa de Crescimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa de Crescimento, dtype: bool

In [57]:
# Usando numpy para alimentar a coluna
df2['Taxa de Crescimento'] = np.arange(5. )

In [58]:
df2

                 Estado  Taxa de Desemprego  Taxa de Crescimento   Ano
estado1  Santa Catarina                 1.5                  0.0  2004
estado2  Rio de Janeiro                 5.1                  1.0  2005
estado3       Tocantins                 1.7                  2.0  2006
estado4           Bahia                 7.2                  3.0  2007
estado5    Minas Gerais                 2.4                  4.0  2008

In [61]:
df2.dtypes

Estado                  object
Taxa de Desemprego     float64
Taxa de Crescimento    float64
Ano                      int64
dtype: object

In [59]:
df2['Taxa de Crescimento'].isna()

estado1    False
estado2    False
estado3    False
estado4    False
estado5    False
Name: Taxa de Crescimento, dtype: bool

In [62]:
df2.describe()

       Taxa de Desemprego  Taxa de Crescimento          Ano
count            5.000000             5.000000     5.000000
mean             3.580000             2.000000  2006.000000
std              2.483345             1.581139     1.581139
min              1.500000             0.000000  2004.000000
25%              1.700000             1.000000  2005.000000
50%              2.400000             2.000000  2006.000000
75%              5.100000             3.000000  2007.000000
max              7.200000             4.000000  2008.000000

# slicing da DataFrames do Pandas

In [63]:
df2

                 Estado  Taxa de Desemprego  Taxa de Crescimento   Ano
estado1  Santa Catarina                 1.5                  0.0  2004
estado2  Rio de Janeiro                 5.1                  1.0  2005
estado3       Tocantins                 1.7                  2.0  2006
estado4           Bahia                 7.2                  3.0  2007
estado5    Minas Gerais                 2.4                  4.0  2008

In [64]:
df2['estado2': 'estado4']

                 Estado  Taxa de Desemprego  Taxa de Crescimento   Ano
estado2  Rio de Janeiro                 5.1                  1.0  2005
estado3       Tocantins                 1.7                  2.0  2006
estado4           Bahia                 7.2                  3.0  2007

In [66]:
df2[df2['Taxa de Desemprego'] < 2]

                 Estado  Taxa de Desemprego  Taxa de Crescimento   Ano
estado1  Santa Catarina                 1.5                  0.0  2004
estado3       Tocantins                 1.7                  2.0  2006

In [67]:
df2[['Estado', 'Taxa de Crescimento']]

                 Estado  Taxa de Crescimento
estado1  Santa Catarina                  0.0
estado2  Rio de Janeiro                  1.0
estado3       Tocantins                  2.0
estado4           Bahia                  3.0
estado5    Minas Gerais                  4.0

In [68]:
df2[['Estado', 'Taxa de Crescimento', 'Ano']]

                 Estado  Taxa de Crescimento   Ano
estado1  Santa Catarina                  0.0  2004
estado2  Rio de Janeiro                  1.0  2005
estado3       Tocantins                  2.0  2006
estado4           Bahia                  3.0  2007
estado5    Minas Gerais                  4.0  2008